function TermsOfService() {
  return (
    <div className='mx-auto max-w-[800px] px-3 py-5 lg:px-5'>
      <h1 className='mt-5 text-center text-3xl font-semibold'>利用規約</h1>
      <div>
        <h2 className='text-xl font-semibold'>概要</h2>
        <div className='space-y-2 text-justify'>
          <p>
            このWebサイトは、スペシャライズドCPOによって運営されています。
            サイト全体で、「私たち」という用語は、スペシャライズドCPOを指します。スペシャライズドCPOは、このサイトから提供されるすべての情報、ツール、サービスを含め、このWebサイトを提供しています。
            ユーザーは、ここに記載されているすべての条件、ポリシー、および通知に同意することを条件とします。
          </p>
          <p>
            当社のサイトにアクセスしたり、当社から何かを購入したりすることにより、お客様は当社の「サービス」に従事し、以下の利用規約（「サービス条件」、「規約」）に拘束されることに同意します。これには、本サイトで参照されている、またはハイパーリンクで利用可能な追加の条件および方針が含まれます。
            本利用規約は、本サイトのすべてのユーザーに適用されます。
          </p>
          <p>
            当社のウェブサイトにアクセスまたは利用する前に、本利用規約をよくお読みください。
            本サイトのいずれかの部分にアクセスまたは使用することにより、お客様は本利用規約に拘束されることに同意したことになります。
            本利用規約のすべての条項に同意されない場合は、ウェブサイトにアクセスしたり、いかなるサービスも利用することはできません。
            本サービス条件が申し出とみなされる場合、受け入れは本サービス条件に明示的に限定されます。
          </p>
          <p>
            現在のストアに追加される新機能やツールにも利用規約が適用されるものとします。
            利用規約の最新版は、このページでいつでも確認することができます。
            当社は、本利用規約の更新および/または変更を当社のウェブサイトに掲載することにより、本利用規約の一部を更新、変更または置換する権利を留保します。
            このページを定期的にチェックして変更を確認するのはお客様の責任です。
            変更の掲載後、お客様が継続して本ウェブサイトを利用またはアクセスされた場合、それらの変更を受諾されたものとします。
          </p>
          <p>
            私たちのストアはShopify
            Inc.でホストされています。彼らは、私たちが製品やサービスをお客様に販売するためのオンラインEコマースプラットフォームを提供しています。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>1. オンラインストアの利用規約</h2>
        <div className='space-y-2 text-justify'>
          <p>
            本利用規約に同意することにより、お客様は、居住する都道府県または地域において少なくとも成人年齢に達していること、または居住する都道府県または地域において成人年齢に達しており、お客様の未成年の扶養家族が本サイトを利用することに同意していることを表明します。
          </p>
          <p>
            お客様は、違法または未承認の目的で当社製品を使用することはできません。また、お客様は、本サービスの使用において、お客様の管轄区域の法律（著作権法を含むがこれに限定されない）に違反することはできません。
          </p>
          <p>
            お客様は、ワーム、ウィルス、または破壊的性質のコードを送信してはなりません。
          </p>
          <p>
            本規約のいずれかの違反または違反があった場合、お客様のサービスは直ちに終了します。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>2. 一般的な条件</h2>
        <div className='space-y-2 text-justify'>
          <p>
            当社は、いつでも誰に対しても、いかなる理由でもサービスを拒否する権利を有しています。
          </p>
          <p>
            お客様は、お客様のコンテンツ（クレジットカード情報を含みません）が暗号化されずに転送され、(a)さまざまなネットワークを介した転送、(b)接続するネットワークや機器の技術的要件に適合させるための変更を伴う場合があることを理解しているものとします。クレジットカード情報は、ネットワーク上の転送時に常に暗号化されます。
          </p>
          <p>
            お客様は、当社の書面による明示的な許可なく、本サービスの一部、本サービスの利用、本サービスへのアクセスまたは本サービスが提供されているウェブサイトの連絡先を複製、複写、コピー、販売、再販またはサービスの任意の部分を悪用しないことに同意するものとします。
          </p>
          <p>
            本規約で使用されている見出しは、便宜上含まれているものであり、本規約を制限したり、その他の形で影響を与えるものではありません。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>
          3. 情報の正確性、完全性、適時性
        </h2>
        <div className='space-y-2 text-justify'>
          <p>
            本サイトで利用可能な情報が正確、完全または最新でない場合、当社は責任を負いません。本サイトの資料は、一般的な情報としてのみ提供されており、より正確で、より完全で、よりタイムリーな情報源に相談することなく、意思決定の唯一の根拠として依拠したり、使用したりしてはいけません。本サイト上の資料への依存は、お客様ご自身の責任において行われるものとします。
          </p>
          <p>
            このサイトには、特定の歴史的情報が含まれている場合があります。歴史的な情報は、必然的に最新のものではなく、お客様の参考のためにのみ提供されます。当社は、本サイトの内容をいつでも変更する権利を留保しますが、本サイトのいかなる情報も更新する義務はありません。お客様は、当サイトの変更を監視することがお客様の責任であることに同意するものとします。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>4. サービスと価格の変更</h2>
        <div className='space-y-2 text-justify'>
          <p>当社製品の価格は、予告なく変更されることがあります。</p>
          <p>
            当社は、いつでも予告なしに、本サービス（またはその一部やコンテンツ）を変更または中止する権利を有します。
          </p>
          <p>
            当社は、本サービスの変更、価格変更、停止または中止について、お客様または第三者に対して責任を負わないものとします。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>5. 保証の否認、責任の制限</h2>
        <div className='space-y-2 text-justify'>
          <p>
            当社は、お客様による当社サービスの利用が、中断されず、タイムリーで、安全で、エラーのないものであることを保証、表明、または担保しません。
          </p>
          <p>
            また、当社は、本サービスの利用により得られる結果が正確であること、または信頼できるものであることを保証しません。
            お客様は、当社が随時、お客様に通知することなく、無期限にサービスを削除したり、サービスを中止したりすることに同意するものとします。
          </p>
          <p>
            お客様は、本サービスの利用または利用できないことが、お客様ご自身の責任であることに明示的に同意されたものとします。本サービスおよび本サービスを通じてお客様に提供されるすべての製品およびサービスは、（当社が明示的に記載した場合を除き）お客様の使用のために「現状のまま」かつ「利用可能な状態」で提供され、明示的または黙示的を問わず、商品性、商品的品質、特定目的への適合性、耐久性、権原、および非侵害に関するすべての黙示的な保証または条件を含む、いかなる種類の表明、保証または条件もありません。
          </p>
          <p>
            いかなる場合においても、当社の取締役、役員、従業員、関連会社、代理人、契約者、インターン、サプライヤー、サービスプロバイダー、ライセンサーは、契約、不法行為（過失を含む）、厳格な責任、またはその他に基づいているかどうかにかかわらず、傷害、損失、請求、または直接的、間接的、偶発的、懲罰的、特別、または結果的な損害（利益損失、収益損失、貯蓄損失、データ損失、交換コスト、またはその他の類似の損害を含むがこれらに限定されない）について責任を負いません。お客様による本サービスもしくは本サービスを利用して調達した製品の利用に起因するもの、またはお客様による本サービスもしくは本製品の利用に何らかの形で関連するその他の請求（コンテンツの誤りもしくは脱落、または本サービスもしくは本サービスを通じて投稿、送信、もしくはその他の方法で利用可能となったコンテンツ（もしくは製品）の利用の結果生じたあらゆる種類の損失もしくは損害を含みますが、これらに限定されません）。
          </p>
          <p>
            一部の都道府県または法域では、結果的または偶発的な損害に対する責任の除外または制限が認められていないため、そのような都道府県または法域では、当社の責任は法律で認められる最大限の範囲に制限されるものとします。
          </p>
        </div>
      </div>
      <div className='mt-6'>
        <h2 className='text-xl font-semibold'>6. 連絡先情報</h2>
        <div className='space-y-2 text-justify'>
          <p>
            本利用規約および当社がお客様にサービスを提供するための個別契約は、日本国の法律に準拠して解釈されます。
          </p>
          <p>
            利用規約に関するご質問は、info@specialized-cpo.comまでお寄せください。
          </p>
        </div>
      </div>
    </div>
  );
}

export default TermsOfService;
